<template>
  <section class="popup">
    <the-about>
      <the-features :features-info="features" />
    </the-about>
    <the-vacancies :vacancies-info="vacancies" />
    <the-contacts />
  </section>
</template>

<script>
import TheAbout from './components/TheAbout.vue';
import TheContacts from './components/TheContacts.vue';
import TheFeatures from './components/TheFeatures.vue';
import TheVacancies from './components/TheVacancies.vue';

export default {
  components: { TheFeatures, TheVacancies, TheContacts, TheAbout },
  data() {
    return {
      features: ['Удаленка', 'Высокая зарплата', 'Обучение', 'Вечеринки', 'Сильная команда'],
      vacancies: [
        {
          id: 1,
          name: 'Middle Web Developer',
          experience: '>6',
          description:
            'Самостоятельный дизайнер с отличной насмотренностью, который способен без помощи арт-директора решать как базовые дизайн-задачи так и сложные (дизайн лендингов, подач, презентаций и тд.)',
          info: [
            {
              id: 1,
              name: 'Требования',
              list: [
                'Опыт работы в сфере графики и веба: 6–9 лет и выше',
                'Умение при необходимости самостоятельно взаимодействовать в коммуникации с подрядчиком',
                'Понимание проектирования взаимодействия и создания информационной архитектуры проекта',
                'Сильное портфолио с кейсами в сфере корпоративного/информационного веба',
                'Умение декомпозировать задачи, организовывать и синхронизировать командную работу с другими дизайнерами',
                'Умение быстро подобрать нужные референсы из топовых работ в сфере веба и использовать их в работе',
                'Ответственность, желание развиваться, обучаемость, перфекционизм, любовь к деталям и минимализму'
              ]
            },
            {
              id: 2,
              name: 'Обязанности',
              list: [
                'Создавать концепцию, продумывать структуры и функционал продукта',
                'Заниматься доработкой проектов',
                'Заниматься проектированием и дизайном интерфейсов, подготовкой рабочих макетов для передачи в команду разработки',
                'Работать с фотоматериалами, с иллюстрациями, обработкой, коллажированием., пиктограммами, другой графикой',
                'Выполнять работы по дизайну и проектированию веб-и мобильных интерфейсов'
              ]
            },
            {
              id: 3,
              name: 'Стек',
              list: [
                'Figma',
                'Ps',
                'Ai',
                'Сильное портфолио с кейсами в сфере корпоративного/информационного веба',
                'AE',
                '3d редакторы (оптимально Blender)',
                'webflow'
              ]
            }
          ]
        }
      ]
    };
  }
};
</script>

<style lang="scss" scoped>
.popup {
  @include gridable();
  justify-content: center;
  background-color: $color-background;
}
</style>
